Revit 2026 API

# FamilyInstanceIsSlantedColumn Property

---

Indicates if the family instance is a slanted column.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsSlantedColumn { get; }
```
```vb
Public ReadOnly Property IsSlantedColumn As Boolean
	Get
```
```cpp
public:
property bool IsSlantedColumn {
	bool get ();
}
```
```fsharp
member IsSlantedColumn : bool with get
```

#### Property Value

Boolean

If the family instance is a slanted column, it returns true, otherwise returns false.

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace